<!-- dflook/terraform-github-actions {"workspace":"fallback-parse-2","backend_type":"remote","backend":"4eb56e5a58e8c6e64f2ef1da66b20c511c28595d2c80c0b6c04caf5d87949a4b","plan_job_ref":"Job Test Terraform cloud #281 at https://github.com/dflook/terraform-github-actions/actions/runs/12936377720","plan_hash":"cefcf532092c71d1ee3f279e25ed4705b54d194f50d1dd5b3d517aea18cfb937","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __fallback-parse-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #281](https://github.com/dflook/terraform-github-actions/actions/runs/12936377720)